workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/scxfs_8dev_1KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 107213
[OVERALL], Throughput(ops/sec), 191021.61118521076
[TOTAL_GCS_G1_Young_Generation], Count, 126
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 614
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5726917444712861
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 126
[TOTAL_GC_TIME], Time(ms), 614
[TOTAL_GC_TIME_%], Time(%), 0.5726917444712861
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 2246.5625
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 143615
[CLEANUP], 95thPercentileLatency(us), 8
[CLEANUP], 99thPercentileLatency(us), 23
[INSERT], Operations, 20480000
[INSERT], AverageLatency(us), 316.63120390625
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 27551
[INSERT], 95thPercentileLatency(us), 411
[INSERT], 99thPercentileLatency(us), 589
[INSERT], Return=OK, 20480000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 132442
[OVERALL], Throughput(ops/sec), 154633.72646139443
[TOTAL_GCS_G1_Young_Generation], Count, 103
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 512
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.38658431615348604
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 103
[TOTAL_GC_TIME], Time(ms), 512
[TOTAL_GC_TIME_%], Time(%), 0.38658431615348604
[READ], Operations, 10239143
[READ], AverageLatency(us), 135.20553487728415
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 41599
[READ], 95thPercentileLatency(us), 515
[READ], 99thPercentileLatency(us), 706
[READ], Return=OK, 10239143
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3974.59375
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 253951
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 19
[UPDATE], Operations, 10240857
[UPDATE], AverageLatency(us), 669.9311676747366
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 44031
[UPDATE], 95thPercentileLatency(us), 1878
[UPDATE], 99thPercentileLatency(us), 7087
[UPDATE], Return=OK, 10240857
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 90014
[OVERALL], Throughput(ops/sec), 227520.16353011754
[TOTAL_GCS_G1_Young_Generation], Count, 103
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 441
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4899237896327238
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 103
[TOTAL_GC_TIME], Time(ms), 441
[TOTAL_GC_TIME_%], Time(%), 0.4899237896327238
[READ], Operations, 10242366
[READ], AverageLatency(us), 107.32356400855036
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 31759
[READ], 95thPercentileLatency(us), 334
[READ], 99thPercentileLatency(us), 470
[READ], Return=OK, 10242366
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4688.875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 299775
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 19
[UPDATE], Operations, 10237634
[UPDATE], AverageLatency(us), 432.5190852691159
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 32175
[UPDATE], 95thPercentileLatency(us), 737
[UPDATE], 99thPercentileLatency(us), 2045
[UPDATE], Return=OK, 10237634
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 84604
[OVERALL], Throughput(ops/sec), 242068.93291097347
[TOTAL_GCS_G1_Young_Generation], Count, 101
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 428
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5058862465131673
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 101
[TOTAL_GC_TIME], Time(ms), 428
[TOTAL_GC_TIME_%], Time(%), 0.5058862465131673
[READ], Operations, 10241546
[READ], AverageLatency(us), 90.84410449359892
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 22479
[READ], 95thPercentileLatency(us), 257
[READ], 99thPercentileLatency(us), 362
[READ], Return=OK, 10241546
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6972.234375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 445951
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 25
[UPDATE], Operations, 10238454
[UPDATE], AverageLatency(us), 414.08427453988656
[UPDATE], MinLatency(us), 8
[UPDATE], MaxLatency(us), 19567
[UPDATE], 95thPercentileLatency(us), 693
[UPDATE], 99thPercentileLatency(us), 1956
[UPDATE], Return=OK, 10238454
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 90284
[OVERALL], Throughput(ops/sec), 226839.75012183774
[TOTAL_GCS_G1_Young_Generation], Count, 103
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 430
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.47627486597846797
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 103
[TOTAL_GC_TIME], Time(ms), 430
[TOTAL_GC_TIME_%], Time(%), 0.47627486597846797
[READ], Operations, 10239758
[READ], AverageLatency(us), 111.91895072129634
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 16495
[READ], 95thPercentileLatency(us), 364
[READ], 99thPercentileLatency(us), 507
[READ], Return=OK, 10239758
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7509.40625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 480255
[CLEANUP], 95thPercentileLatency(us), 15
[CLEANUP], 99thPercentileLatency(us), 52
[UPDATE], Operations, 10240242
[UPDATE], AverageLatency(us), 428.88985992713845
[UPDATE], MinLatency(us), 8
[UPDATE], MaxLatency(us), 22719
[UPDATE], 95thPercentileLatency(us), 742
[UPDATE], 99thPercentileLatency(us), 1973
[UPDATE], Return=OK, 10240242
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 86238
[OVERALL], Throughput(ops/sec), 237482.31638025
[TOTAL_GCS_G1_Young_Generation], Count, 103
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 404
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4684709756719776
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 103
[TOTAL_GC_TIME], Time(ms), 404
[TOTAL_GC_TIME_%], Time(%), 0.4684709756719776
[READ], Operations, 10239402
[READ], AverageLatency(us), 99.4431944365501
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 26399
[READ], 95thPercentileLatency(us), 301
[READ], 99thPercentileLatency(us), 431
[READ], Return=OK, 10239402
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6939.59375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 443903
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 22
[UPDATE], Operations, 10240598
[UPDATE], AverageLatency(us), 416.28150455666747
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 22399
[UPDATE], 95thPercentileLatency(us), 705
[UPDATE], 99thPercentileLatency(us), 1938
[UPDATE], Return=OK, 10240598
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 90789
[OVERALL], Throughput(ops/sec), 225577.98852283866
[TOTAL_GCS_G1_Young_Generation], Count, 103
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 443
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.48794457478328873
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 103
[TOTAL_GC_TIME], Time(ms), 443
[TOTAL_GC_TIME_%], Time(%), 0.48794457478328873
[READ], Operations, 10240611
[READ], AverageLatency(us), 107.7172975323445
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 24175
[READ], 95thPercentileLatency(us), 350
[READ], 99thPercentileLatency(us), 507
[READ], Return=OK, 10240611
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8257.796875
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 528383
[CLEANUP], 95thPercentileLatency(us), 13
[CLEANUP], 99thPercentileLatency(us), 36
[UPDATE], Operations, 10239389
[UPDATE], AverageLatency(us), 435.0156770096341
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 28143
[UPDATE], 95thPercentileLatency(us), 737
[UPDATE], 99thPercentileLatency(us), 2153
[UPDATE], Return=OK, 10239389
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 92462
[OVERALL], Throughput(ops/sec), 221496.39852047327
[TOTAL_GCS_G1_Young_Generation], Count, 185
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 647
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6997469230602843
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 185
[TOTAL_GC_TIME], Time(ms), 647
[TOTAL_GC_TIME_%], Time(%), 0.6997469230602843
[READ], Operations, 10242384
[READ], AverageLatency(us), 116.00637498066857
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 21471
[READ], 95thPercentileLatency(us), 377
[READ], 99thPercentileLatency(us), 537
[READ], Return=OK, 10242384
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8102.546875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 518143
[CLEANUP], 95thPercentileLatency(us), 23
[CLEANUP], 99thPercentileLatency(us), 39
[UPDATE], Operations, 10237616
[UPDATE], AverageLatency(us), 438.6699483551639
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 21727
[UPDATE], 95thPercentileLatency(us), 749
[UPDATE], 99thPercentileLatency(us), 2147
[UPDATE], Return=OK, 10237616
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 94104
[OVERALL], Throughput(ops/sec), 217631.55657570346
[TOTAL_GCS_G1_Young_Generation], Count, 100
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 413
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4388761370398708
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 100
[TOTAL_GC_TIME], Time(ms), 413
[TOTAL_GC_TIME_%], Time(%), 0.4388761370398708
[READ], Operations, 10236249
[READ], AverageLatency(us), 116.43933690944799
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 21551
[READ], 95thPercentileLatency(us), 393
[READ], 99thPercentileLatency(us), 586
[READ], Return=OK, 10236249
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7370.53125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 471295
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 26
[UPDATE], Operations, 10243751
[UPDATE], AverageLatency(us), 449.3651435885156
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 36351
[UPDATE], 95thPercentileLatency(us), 779
[UPDATE], 99thPercentileLatency(us), 2219
[UPDATE], Return=OK, 10243751
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 98292
[OVERALL], Throughput(ops/sec), 208358.76775322508
[TOTAL_GCS_G1_Young_Generation], Count, 101
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 457
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4649411956212103
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 101
[TOTAL_GC_TIME], Time(ms), 457
[TOTAL_GC_TIME_%], Time(%), 0.4649411956212103
[READ], Operations, 10239430
[READ], AverageLatency(us), 138.25362896176838
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 20751
[READ], 95thPercentileLatency(us), 513
[READ], 99thPercentileLatency(us), 786
[READ], Return=OK, 10239430
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8060.953125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 515583
[CLEANUP], 95thPercentileLatency(us), 13
[CLEANUP], 99thPercentileLatency(us), 59
[UPDATE], Operations, 10240570
[UPDATE], AverageLatency(us), 449.57597819262014
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 45279
[UPDATE], 95thPercentileLatency(us), 844
[UPDATE], 99thPercentileLatency(us), 2113
[UPDATE], Return=OK, 10240570
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 88396
[OVERALL], Throughput(ops/sec), 231684.6916150052
[TOTAL_GCS_G1_Young_Generation], Count, 167
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 587
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6640571971582424
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 167
[TOTAL_GC_TIME], Time(ms), 587
[TOTAL_GC_TIME_%], Time(%), 0.6640571971582424
[READ], Operations, 10239858
[READ], AverageLatency(us), 102.68777369764307
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 25567
[READ], 95thPercentileLatency(us), 331
[READ], 99thPercentileLatency(us), 505
[READ], Return=OK, 10239858
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 1611.78125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 102655
[CLEANUP], 95thPercentileLatency(us), 34
[CLEANUP], 99thPercentileLatency(us), 60
[UPDATE], Operations, 10240142
[UPDATE], AverageLatency(us), 429.28001672242436
[UPDATE], MinLatency(us), 8
[UPDATE], MaxLatency(us), 33951
[UPDATE], 95thPercentileLatency(us), 726
[UPDATE], 99thPercentileLatency(us), 1942
[UPDATE], Return=OK, 10240142
*---------------------------------- ycsb run end ------------------------------*
experiment end.